USE [中文北風];

WITH Temp
AS
(
	SELECT D.類別名稱,MONTH(A.訂單日期) AS 月份,SUM(B.數量) AS 總銷售數量
	FROM 訂貨主檔 AS A JOIN 訂貨明細 AS B ON A.訂單號碼=B.訂單號碼
		JOIN 產品資料 AS C ON B.產品編號=C.產品編號
		JOIN 產品類別 AS D ON C.類別編號=D.類別編號
	WHERE A.訂單日期>='2003-1-1' AND A.訂單日期<'2004-1-1'
	GROUP BY D.類別名稱,MONTH(A.訂單日期)
)

/*
SELECT 類別名稱,[1],[2],[3],[4],[5],[6],[7],[8],[9],[10],[11],[12]
FROM Temp 
PIVOT (SUM(總銷售數量) FOR 月份 IN([1],[2],[3],[4],[5],[6],[7],[8],[9],[10],[11],[12])) AS P
*/

--[日用品],[肉/家禽],[海鮮],[特製品],[飲料],[穀類/麥片],[調味品],[點心]
SELECT 月份,[日用品],[肉/家禽],[海鮮],[特製品],[飲料],[穀類/麥片],[調味品],[點心]
FROM Temp 
PIVOT (SUM(總銷售數量) FOR 類別名稱 IN ([日用品],[肉/家禽],[海鮮],[特製品],[飲料],[穀類/麥片],[調味品],[點心])) AS P

